In [1]:
import pandas as pd

#### Series
데이터프레임의 하나의 column, feature를 의미함

기본적으로는 numpy array의 subclass

In [2]:
from pandas import Series, DataFrame

In [6]:
example_obj = Series(['a', 'b', 3, 4, 5])    # 일종의 객체처럼 사용
example_obj   # index와 value로 구성되어 있음

0    a
1    b
2    3
3    4
4    5
dtype: object

In [7]:
list_data = [1, 2, 3, 4, 5]
list_name = ['a', 'b', 'c', 'd', 'e']
Series(data=list_data, index = list_name)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
dict_data = {'a' : 1, 'b' : 2, 'c' : 3, 'd' : 4, 'e' : 5}
example_obj = Series(dict_data, name = 'Series from dict')
example_obj

a    1
b    2
c    3
d    4
e    5
Name: Series from dict, dtype: int64

In [12]:
print(example_obj)
example_obj['a'] = 3
print(example_obj)

a    1
b    2
c    3
d    4
e    5
Name: Series from dict, dtype: int64
a    3
b    2
c    3
d    4
e    5
Name: Series from dict, dtype: int64

In [16]:
print(example_obj.values)
print(example_obj.index)
   # values와 index만 np.array 형태로 추출할 수 있음

[3 2 3 4 5]
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [21]:
example_obj = Series([5, 4, 3, 2, 1, 2, 3, 4, 5])
example_obj[example_obj > 2]      # boolean index 적용 가능

0    5
1    4
2    3
6    3
7    4
8    5
dtype: int64

In [22]:
example_obj * 2      # broadcasting 적용 가능

0    10
1     8
2     6
3     4
4     2
5     4
6     6
7     8
8    10
dtype: int64

#### DataFrame

In [27]:
raw_data = {'first_name' : ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
           'lsat_name' : ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
           'age' : [42, 52, 36, 24, 73],
           'city' : ['San Francisco',  'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason       NaN   42  San Francisco
1      Molly       NaN   52      Baltimore
2       Tina       NaN   36          Miami
3       Jake       NaN   24        Douglas
4        Amy       NaN   73         Boston

In [25]:
pd.DataFrame(raw_data, columns = ['age', 'city'])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [26]:
DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])

  first_name last_name  age           city debt
0      Jason       NaN   42  San Francisco  NaN
1      Molly       NaN   52      Baltimore  NaN
2       Tina       NaN   36          Miami  NaN
3       Jake       NaN   24        Douglas  NaN
4        Amy       NaN   73         Boston  NaN

In [29]:
df['first_name']   # col 기준으로 Series 추출

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [32]:
df.loc[1]      # index location을 기준으로 instance 추출

first_name        Molly
last_name           NaN
age                  52
city          Baltimore
Name: 1, dtype: object

In [33]:
df['age'].iloc[1:]     # iloc은 index number를 기준으로 추출

1    52
2    36
3    24
4    73
Name: age, dtype: int64